tap "daipeihust/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Cryptocurrency exchange
cask "binance"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# Write, edit, and chat about your code with AI
cask "cursor"
# Calendar software
cask "fantastical"
# Font for Development
cask "font-jetbrains-mono-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Find shortcuts for any installed application
cask "keyclu"
# Software for Logitech devices
cask "logi-options+"
# Adaptive brightness for external displays
cask "lunar"
# Media player
cask "movist-pro"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Email client
cask "readdle-spark"
# Music streaming service
cask "spotify"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Messaging app with a focus on speed and security
cask "telegram"
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "miele-lxiv", id: 988332475
mas "ScreenFloat", id: 414528154
mas "카카오톡", id: 869223134

